In [1]:
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns 

from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score
from sklearn.preprocessing import StandardScaler

# Setting to make numbers easier to read on display 
pd.options.display.float_format = '{:20.2f}'.format

# show all columns on output 
pd.set_option('display.max_columns', 999)

## Data Exploration

In [2]:
### MongoDB credentials
DB_NAME= "UNDERSTAND_CUSTOMER"
COLLECTION_NAME= "customer_data"
CONNECTION_URL = "mongodb+srv://dhiraj_pakhrin007:dpakhrin123@cluster0.mbr8lpc.mongodb.net/?appName=Cluster0"

In [3]:
import pymongo

In [4]:
client = pymongo.MongoClient(CONNECTION_URL)
data_base = client[DB_NAME]
collection = data_base[COLLECTION_NAME]

In [5]:
records = collection.find()
records

In [6]:
df = pd.DataFrame(list(records))
df.head()

,_id,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,692cde928bfa111b74715156,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.00,United Kingdom
1,692cde928bfa111b74715157,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom
2,692cde928bfa111b74715158,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom
3,692cde928bfa111b74715159,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.00,United Kingdom
4,692cde928bfa111b7471515a,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.00,United Kingdom

In [7]:
## _id columns is generated in mongodb which is not required
df.drop(columns=['_id'], axis=1, inplace=True)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 625461 entries, 0 to 625460
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      625461 non-null  object
 1   StockCode    625461 non-null  object
 2   Description  621663 non-null  object
 3   Quantity     625461 non-null  int64
 4   InvoiceDate  625461 non-null  datetime64[ns]
 5   Price        625461 non-null  float64
 6   Customer ID  490395 non-null  float64
 7   Country      625461 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 38.2+ MB

In [9]:
df.describe()

,Quantity,InvoiceDate,Price,Customer ID
count,625461.00,625461,625461.00,490395.00
mean,10.43,2010-05-31 20:56:35.888952576,4.67,15356.93
min,-9600.00,2009-12-01 07:45:00,-53594.36,12346.00
25%,1.00,2010-02-02 08:39:00,1.25,13984.00
50%,3.00,2010-05-26 14:51:00,2.10,15311.00
75%,10.00,2010-10-03 14:13:00,4.24,16797.00
max,19152.00,2010-12-09 20:01:00,25111.09,18287.00
std,108.61,NaN,135.36,1679.74

In [10]:
## describe categorical features
df.describe(include='O')

        Invoice StockCode                         Description         Country
count    625461    625461                              621663          625461
unique    28816      4632                                4681              40
top      490074    85123A  WHITE HANGING HEART T-LIGHT HOLDER  United Kingdom
freq       1160      4294                                4326          579294

In [11]:
## dropping duplicate entries
df = df.drop_duplicates()

In [13]:
## checking the records with no customer_id
df[df['Customer ID'].isna()].head(10)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
263,489464,21733,85123a mixed,-96,2009-12-01 10:52:00,0.00,NaN,United Kingdom
283,489463,71477,short,-240,2009-12-01 10:52:00,0.00,NaN,United Kingdom
284,489467,85123A,21733 mixed,-192,2009-12-01 10:53:00,0.00,NaN,United Kingdom
470,489521,21646,NaN,-50,2009-12-01 11:44:00,0.00,NaN,United Kingdom
577,489525,85226C,BLUE PULL BACK RACING CAR,1,2009-12-01 11:49:00,0.55,NaN,United Kingdom
578,489525,85227,SET/6 3D KIT CARDS FOR KIDS,1,2009-12-01 11:49:00,0.85,NaN,United Kingdom
1055,489548,22271,FELTCRAFT DOLL ROSIE,1,2009-12-01 12:32:00,2.95,NaN,United Kingdom
1056,489548,22254,FELT TOADSTOOL LARGE,12,2009-12-01 12:32:00,1.25,NaN,United Kingdom
1057,489548,22273,FELTCRAFT DOLL MOLLY,3,2009-12-01 12:32:00,2.95,NaN,United Kingdom
1058,489548,22195,LARGE HEART MEASURING SPOONS,1,2009-12-01 12:32:00,1.65,NaN,United Kingdom

In [14]:
## checking for cancellation invoice 
df['Invoice'] = df['Invoice'].astype(str)
df[df['Invoice'].str.match("^\\d{6}$") == False]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
178,C489449,22087,PAPER BUNTING WHITE LACE,-12,2009-12-01 10:33:00,2.95,16321.00,Australia
179,C489449,85206A,CREAM FELT EASTER EGG BASKET,-6,2009-12-01 10:33:00,1.65,16321.00,Australia
180,C489449,21895,POTTING SHED SOW 'N' GROW SET,-4,2009-12-01 10:33:00,4.25,16321.00,Australia
181,C489449,21896,POTTING SHED TWINE,-6,2009-12-01 10:33:00,2.10,16321.00,Australia
182,C489449,22083,PAPER CHAIN KIT RETRO SPOT,-12,2009-12-01 10:33:00,2.95,16321.00,Australia
...,...,...,...,...,...,...,...,...
524695,C538123,22956,36 FOIL HEART CAKE CASES,-2,2010-12-09 15:41:00,2.10,12605.00,Germany
524696,C538124,M,Manual,-4,2010-12-09 15:43:00,0.50,15329.00,United Kingdom
524697,C538124,22699,ROSES REGENCY TEACUP AND SAUCER,-1,2010-12-09 15:43:00,2.95,15329.00,United Kingdom
524698,C538124,22423,REGENCY CAKESTAND 3 TIER,-1,2010-12-09 15:43:00,12.75,15329.00,United Kingdom
525282,C538164,35004B,SET OF 3 BLACK FLYING DUCKS,-1,2010-12-09 17:32:00,1.95,14031.00,United Kingdom

In [15]:
## Checking if there is any characters except 'C' in invoice 
df['Invoice'].str.replace("[0-9]", "", regex=True).unique()

array(['', 'C', 'A'], dtype=object)

In [16]:
df[df['Invoice'].str.startswith("A")]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
179403,A506401,B,Adjust bad debt,1,2010-04-29 13:36:00,-53594.36,NaN,United Kingdom
276274,A516228,B,Adjust bad debt,1,2010-07-19 11:24:00,-44031.79,NaN,United Kingdom
403472,A528059,B,Adjust bad debt,1,2010-10-20 12:04:00,-38925.87,NaN,United Kingdom

In [17]:
## Validating StockCode
df['StockCode'] = df['StockCode'].astype(str)
df[(df['StockCode'].str.match("^\\d{5}$") == False) & (df['StockCode'].str.match("^\\d{5}[a-zA-Z]+$") == False)]["StockCode"].unique()

array(['POST', 'D', 'DCGS0058', 'DCGS0068', 'DOT', 'M', 'DCGS0004',
       'DCGS0076', 'C2', 'BANK CHARGES', 'DCGS0003', 'TEST001',
       'gift_0001_80', 'DCGS0072', 'gift_0001_20', 'DCGS0044', 'TEST002',
       'gift_0001_10', 'gift_0001_50', 'DCGS0066N', 'gift_0001_30',
       'PADS', 'ADJUST', 'gift_0001_40', 'gift_0001_60', 'gift_0001_70',
       'gift_0001_90', 'DCGSSGIRL', 'DCGS0006', 'DCGS0016', 'DCGS0027',
       'DCGS0036', 'DCGS0039', 'DCGS0060', 'DCGS0056', 'DCGS0059', 'GIFT',
       'DCGSLBOY', 'm', 'DCGS0053', 'DCGS0062', 'DCGS0037', 'DCGSSBOY',
       'DCGSLGIRL', 'S', 'DCGS0069', 'DCGS0070', 'DCGS0075', 'B',
       'DCGS0041', 'ADJUST2', '47503J ', 'C3', 'SP1002', 'AMAZONFEE'],
      dtype=object)

In [18]:
df[df['StockCode'].str.contains('DOT')]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
2379,489597,DOT,DOTCOM POSTAGE,1,2009-12-01 14:28:00,647.19,NaN,United Kingdom
2539,489600,DOT,DOTCOM POSTAGE,1,2009-12-01 14:43:00,55.96,NaN,United Kingdom
2551,489601,DOT,DOTCOM POSTAGE,1,2009-12-01 14:44:00,68.39,NaN,United Kingdom
2571,489602,DOT,DOTCOM POSTAGE,1,2009-12-01 14:45:00,59.35,NaN,United Kingdom
2619,489603,DOT,DOTCOM POSTAGE,1,2009-12-01 14:46:00,42.39,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
524272,538071,DOT,DOTCOM POSTAGE,1,2010-12-09 14:09:00,885.94,NaN,United Kingdom
524887,538148,DOT,DOTCOM POSTAGE,1,2010-12-09 16:26:00,547.32,NaN,United Kingdom
525000,538149,DOT,DOTCOM POSTAGE,1,2010-12-09 16:27:00,620.68,NaN,United Kingdom
525126,538153,DOT,DOTCOM POSTAGE,1,2010-12-09 16:31:00,822.94,NaN,United Kingdom
525147,538154,DOT,DOTCOM POSTAGE,1,2010-12-09 16:35:00,85.79,NaN,United Kingdom

In [19]:
df[df['StockCode'].str.contains('^DOT')]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
2379,489597,DOT,DOTCOM POSTAGE,1,2009-12-01 14:28:00,647.19,NaN,United Kingdom
2539,489600,DOT,DOTCOM POSTAGE,1,2009-12-01 14:43:00,55.96,NaN,United Kingdom
2551,489601,DOT,DOTCOM POSTAGE,1,2009-12-01 14:44:00,68.39,NaN,United Kingdom
2571,489602,DOT,DOTCOM POSTAGE,1,2009-12-01 14:45:00,59.35,NaN,United Kingdom
2619,489603,DOT,DOTCOM POSTAGE,1,2009-12-01 14:46:00,42.39,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
524272,538071,DOT,DOTCOM POSTAGE,1,2010-12-09 14:09:00,885.94,NaN,United Kingdom
524887,538148,DOT,DOTCOM POSTAGE,1,2010-12-09 16:26:00,547.32,NaN,United Kingdom
525000,538149,DOT,DOTCOM POSTAGE,1,2010-12-09 16:27:00,620.68,NaN,United Kingdom
525126,538153,DOT,DOTCOM POSTAGE,1,2010-12-09 16:31:00,822.94,NaN,United Kingdom
525147,538154,DOT,DOTCOM POSTAGE,1,2010-12-09 16:35:00,85.79,NaN,United Kingdom

### Notes

#### Stock Code

StockCode is meant to follow the pattern [0-9]{5} but seems to have legit values for [0-9]{5}[a-zA-Z]+
Also contains other values: 
1) DCGS 
- Looks valid, some quantities are negative though and customer ID is null 
- Exclude from clustering


2) D 
- Looks valid, represents discount values
- Exclude from clustering 


3) DOT
- Looks valid, represents postage charges
- Exclude from clustering 


4) M or m 
- Looks valid, represents manual transactions 
- Exclude from clustering 


5) C2 
- Carriage transaction - not sure what this means 
- Exclude from clustering 


6) C3 
- Not sure, only 1 transaction 
- Exclude 


7) BANK CHARGES or B 
- Bank charges 
- Exclude from clustering


8) S 
- Samples sent to customer 
- Exclude from clustering 


9) TESTXXX 
- Testing data, not valid 
- Exclude from clustering 


10) gift__XXX 
- Purchases with gift cards, might be interesting for another analysis, but no customer data 
- Exclude 


11) PADS 
- Looks like a legit stock code for padding 
- Include 


12) SP1002 
- Looks like a special request item, only 2 transactions, 3 look legit, 1 has 0 pricing 
- Exclude for now


13) AMAZONFEE 
- Looks like fees for Amazon shipping or something 
- Exclude for now 


14) ADJUSTX 
- Looks like manual account adjustments by admins 
- Exclude for now

## Data Cleaning

In [20]:
cleaned_df = df.copy()

In [21]:
## Removing bad Invoices
cleaned_df['Invoice'] = cleaned_df['Invoice'].astype("str")

mask = (
    cleaned_df['Invoice'].str.match("^\\d{6}$") == True
)

cleaned_df = cleaned_df[mask]
cleaned_df

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.00,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.00,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.00,United Kingdom
...,...,...,...,...,...,...,...,...
525456,538171,22271,FELTCRAFT DOLL ROSIE,2,2010-12-09 20:01:00,2.95,17530.00,United Kingdom
525457,538171,22750,FELTCRAFT PRINCESS LOLA DOLL,1,2010-12-09 20:01:00,3.75,17530.00,United Kingdom
525458,538171,22751,FELTCRAFT PRINCESS OLIVIA DOLL,1,2010-12-09 20:01:00,3.75,17530.00,United Kingdom
525459,538171,20970,PINK FLORAL FELTCRAFT SHOULDER BAG,2,2010-12-09 20:01:00,3.75,17530.00,United Kingdom
525460,538171,21931,JUMBO STORAGE BAG SUKI,2,2010-12-09 20:01:00,1.95,17530.00,United Kingdom

In [22]:
## Removing bad StockCode

cleaned_df["StockCode"] = cleaned_df["StockCode"].astype("str")

mask = (
    (cleaned_df["StockCode"].str.match("^\\d{5}$") == True)
    | (cleaned_df["StockCode"].str.match("^\\d{5}[a-zA-Z]+$") == True)
    | (cleaned_df["StockCode"].str.match("^PADS$") == True)
)

cleaned_df = cleaned_df[mask]

cleaned_df

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.00,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.00,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.00,United Kingdom
...,...,...,...,...,...,...,...,...
525456,538171,22271,FELTCRAFT DOLL ROSIE,2,2010-12-09 20:01:00,2.95,17530.00,United Kingdom
525457,538171,22750,FELTCRAFT PRINCESS LOLA DOLL,1,2010-12-09 20:01:00,3.75,17530.00,United Kingdom
525458,538171,22751,FELTCRAFT PRINCESS OLIVIA DOLL,1,2010-12-09 20:01:00,3.75,17530.00,United Kingdom
525459,538171,20970,PINK FLORAL FELTCRAFT SHOULDER BAG,2,2010-12-09 20:01:00,3.75,17530.00,United Kingdom
525460,538171,21931,JUMBO STORAGE BAG SUKI,2,2010-12-09 20:01:00,1.95,17530.00,United Kingdom

In [23]:
### Removing records with null customer id

cleaned_df.dropna(subset=['Customer ID'], inplace= True)

C:\Users\NyRz\AppData\Local\Temp\ipykernel_48000\4254421586.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_df.dropna(subset=['Customer ID'], inplace= True)

In [24]:
cleaned_df.describe()

,Quantity,InvoiceDate,Price,Customer ID
count,399594.00,399594,399594.00,399594.00
mean,13.80,2010-07-01 04:54:58.004474880,3.00,15366.65
min,1.00,2009-12-01 07:45:00,0.00,12346.00
25%,2.00,2010-03-26 13:42:00,1.25,13995.00
50%,5.00,2010-07-09 10:26:00,1.95,15311.00
75%,12.00,2010-10-14 14:08:00,3.75,16809.00
max,19152.00,2010-12-09 20:01:00,295.00,18287.00
std,97.80,NaN,4.31,1678.23

In [25]:
### Dealing with Price: 0.00
len(cleaned_df[cleaned_df['Price'] == 0])

28

In [26]:
cleaned_df.describe()

,Quantity,InvoiceDate,Price,Customer ID
count,399594.00,399594,399594.00,399594.00
mean,13.80,2010-07-01 04:54:58.004474880,3.00,15366.65
min,1.00,2009-12-01 07:45:00,0.00,12346.00
25%,2.00,2010-03-26 13:42:00,1.25,13995.00
50%,5.00,2010-07-09 10:26:00,1.95,15311.00
75%,12.00,2010-10-14 14:08:00,3.75,16809.00
max,19152.00,2010-12-09 20:01:00,295.00,18287.00
std,97.80,NaN,4.31,1678.23

In [27]:
cleaned_df = cleaned_df[cleaned_df['Price'] > 0]

In [28]:
cleaned_df['Price'].min()

0.001

In [29]:
### Percentage of data lost after cleaning
len(cleaned_df)/len(df)

0.7704764402347878

##### After cleaning the data, we have dropped around 23% of record